In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('marks_data.csv')

In [15]:
print(df.head())

   Student_ID                Name   Math  Science  English  Total  \
0           1    Louisette Howden     97       66        4    289
1           2        Sayre Harron     69        2       38     46
2           3    Francois Fennell     83       29       65    289
3           4       Irvin Comazzo     78       57       83     17
4           5  Archibaldo Kinahan     99       69       94     62

               Grade
0           solution
1           attitude
2  Re-contextualized
3            ability
4       Face to face

In [4]:
 #to check if there is any NA values
df.isna()

    Student_ID   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
94       False  False  False    False    False  False  False
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False

[99 rows x 7 columns]

In [22]:
#axis=1 , we are taking first row marks and calculating it

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  99 non-null     int64
 1   Name        99 non-null     object
 2    Math       99 non-null     int64
 3   Science     99 non-null     int64
 4   English     99 non-null     int64
 5   Total       99 non-null     int64
 6   Grade       99 non-null     object
dtypes: int64(5), object(2)
memory usage: 5.5+ KB

In [25]:
df.rename(columns={" Math":"Math"},inplace=True)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  99 non-null     int64
 1   Name        99 non-null     object
 2   Math        99 non-null     int64
 3   Science     99 non-null     int64
 4   English     99 non-null     int64
 5   Total       99 non-null     int64
 6   Grade       99 non-null     object
dtypes: int64(5), object(2)
memory usage: 5.5+ KB

In [28]:
 df['Total'] = df[['Math', 'Science', 'English']].sum(axis=1)
print(df[['Name', 'Math', 'Science', 'English', 'Total']])

                  Name  Math  Science  English  Total
0     Louisette Howden    97       66        4    167
1         Sayre Harron    69        2       38    109
2     Francois Fennell    83       29       65    177
3        Irvin Comazzo    78       57       83    218
4   Archibaldo Kinahan    99       69       94    262
..                 ...   ...      ...      ...    ...
94        Candi Wankel    84       96       87    267
95           Adah Hurl    95       89       13    197
96      Lucio Godthaab    82        9       35    126
97  Kingsley Walworche    88       37       92    217
98       Athena Collum    72       12       13     97

[99 rows x 5 columns]

In [29]:
df[['Name', 'Math', 'Science', 'English', 'Total']].head() #just verify the total

                 Name  Math  Science  English  Total
0    Louisette Howden    97       66        4    167
1        Sayre Harron    69        2       38    109
2    Francois Fennell    83       29       65    177
3       Irvin Comazzo    78       57       83    218
4  Archibaldo Kinahan    99       69       94    262

In [32]:
def assign_grade(total):
    if total>=250:
        return 'A'
    elif total>=200:
        return 'B'
    elif total>=150:
        return 'C'
    else:
        return 'D'

In [33]:
df['Grade'] = df['Total'].apply(assign_grade)

In [34]:
df[['Name', 'Total', 'Grade']].tail()

                  Name  Total Grade
94        Candi Wankel    267     A
95           Adah Hurl    197     C
96      Lucio Godthaab    126     D
97  Kingsley Walworche    217     B
98       Athena Collum     97     D

In [36]:
grade_a_students = df[df['Grade']=='A']
print(grade_a_students)

    Student_ID                Name  Math  Science  English  Total Grade
4            5  Archibaldo Kinahan    99       69       94    262     A
71          72     Marylee Mussett    98       74       83    255     A
94          95        Candi Wankel    84       96       87    267     A

In [37]:
grade_a_students= df[df['Grade']=='A']
print(grade_a_students)

    Student_ID                Name  Math  Science  English  Total Grade
4            5  Archibaldo Kinahan    99       69       94    262     A
71          72     Marylee Mussett    98       74       83    255     A
94          95        Candi Wankel    84       96       87    267     A

In [38]:
grade_b_students = df[df['Grade']=='B']
print("No. of students secured grade B: ", len(grade_b_students))

No. of students secured grade B:  11

In [41]:
print('Total no. of students failed: ', len(df[df['Grade']=='D']))

Total no. of students failed:  48

In [43]:
math_max = max(df['Math'])
print(math_max)

100

In [44]:
print(df[df['Math']==math_max])

    Student_ID         Name  Math  Science  English  Total Grade
24          25  Myles Tinan   100       94       26    220     B

In [46]:
df.to_csv('result.csv', index=False)
print("File created successfully")

File created successfully